OdDAI.Number.setUnderlyingType(OdDAI.NamedType!System.Runtime.CompilerServices.IsConst*)
\details
Sets the underlying type for current value.
\returns true if underlying type was changed, otherwise return false.

OdDAI.Number.underlyingTypeName(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the name of current value underlying type for Number.
\returns true if underlying type was changed, otherwise return false.